src/main/resources/reports/stage3/put_results/wrk/wrk_2_async_select_fixed_poll.txt
Running 1m test @ http://localhost:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 2.244ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    1.47ms  29.23ms   88.41%
    Req/Sec    10.55k     1.42k   32.22k    75.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.54ms
 75.000%    2.23ms
 90.000%    3.24ms
 99.000%    7.80ms
 99.900%   14.67ms
 99.990%   22.45ms
 99.999%   25.49ms
100.000%   29.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.665     0.100000        49693         1.11
       0.899     0.200000        99419         1.25
       1.115     0.300000       149102         1.43
       1.325     0.400000       198765         1.67
       1.536     0.500000       248548         2.00
       1.646     0.550000       273384         2.22
       1.764     0.600000       298151         2.50
       1.897     0.650000       323016         2.86
       2.051     0.700000       348073         3.33
       2.231     0.750000       372654         4.00
       2.339     0.775000       385094         4.44
       2.463     0.800000       397491         5.00
       2.607     0.825000       409923         5.71
       2.775     0.850000       422345         6.67
       2.977     0.875000       434774         8.00
       3.097     0.887500       441017         8.89
       3.237     0.900000       447141        10.00
       3.409     0.912500       453406        11.43
       3.621     0.925000       459619        13.33
       3.903     0.937500       465805        16.00
       4.077     0.943750       468892        17.78
       4.291     0.950000       471993        20.00
       4.551     0.956250       475105        22.86
       4.871     0.962500       478202        26.67
       5.283     0.968750       481299        32.00
       5.515     0.971875       482868        35.56
       5.771     0.975000       484413        40.00
       6.055     0.978125       485965        45.71
       6.387     0.981250       487508        53.33
       6.767     0.984375       489074        64.00
       6.987     0.985938       489843        71.11
       7.267     0.987500       490619        80.00
       7.579     0.989062       491396        91.43
       7.959     0.990625       492166       106.67
       8.391     0.992188       492942       128.00
       8.647     0.992969       493329       142.22
       8.919     0.993750       493724       160.00
       9.207     0.994531       494106       182.86
       9.543     0.995313       494501       213.33
      10.007     0.996094       494890       256.00
      10.255     0.996484       495080       284.44
      10.607     0.996875       495275       320.00
      10.983     0.997266       495467       365.71
      11.503     0.997656       495658       426.67
      12.223     0.998047       495852       512.00
      12.647     0.998242       495950       568.89
      13.015     0.998437       496046       640.00
      13.415     0.998633       496148       731.43
      13.999     0.998828       496241       853.33
      14.727     0.999023       496337      1024.00
      15.167     0.999121       496386      1137.78
      15.695     0.999219       496434      1280.00
      16.559     0.999316       496483      1462.86
      17.231     0.999414       496532      1706.67
      17.919     0.999512       496581      2048.00
      18.207     0.999561       496605      2275.56
      18.543     0.999609       496629      2560.00
      19.263     0.999658       496653      2925.71
      19.935     0.999707       496677      3413.33
      20.783     0.999756       496701      4096.00
      21.071     0.999780       496713      4551.11
      21.327     0.999805       496726      5120.00
      21.599     0.999829       496739      5851.43
      22.031     0.999854       496750      6826.67
      22.223     0.999878       496762      8192.00
      22.319     0.999890       496768      9102.22
      22.479     0.999902       496775     10240.00
      22.607     0.999915       496780     11702.86
      22.815     0.999927       496786     13653.33
      22.911     0.999939       496792     16384.00
      22.991     0.999945       496795     18204.44
      23.087     0.999951       496798     20480.00
      23.167     0.999957       496801     23405.71
      23.327     0.999963       496804     27306.67
      23.583     0.999969       496808     32768.00
      23.679     0.999973       496809     36408.89
      23.759     0.999976       496810     40960.00
      23.935     0.999979       496812     46811.43
      24.111     0.999982       496813     54613.33
      24.255     0.999985       496815     65536.00
      25.439     0.999986       496816     72817.78
      25.439     0.999988       496816     81920.00
      25.487     0.999989       496817     93622.86
      25.807     0.999991       496818    109226.67
      26.271     0.999992       496819    131072.00
      26.271     0.999993       496819    145635.56
      26.271     0.999994       496819    163840.00
      26.303     0.999995       496820    187245.71
      26.303     0.999995       496820    218453.33
      27.999     0.999996       496821    262144.00
      27.999     0.999997       496821    291271.11
      27.999     0.999997       496821    327680.00
      27.999     0.999997       496821    374491.43
      27.999     0.999998       496821    436906.67
      29.247     0.999998       496822    524288.00
      29.247     1.000000       496822          inf
#[Mean    =        1.863, StdDeviation   =        1.469]
#[Max     =       29.232, Total count    =       496822]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  589997 requests in 1.00m, 41.64MB read
Requests/sec:   9832.83
Transfer/sec:    710.58KB